---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarElementVisibility
source: html/f8c0818f-f297-f533-2110-a20b4ee61af6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarElementVisibility Property

"View Visibility States"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarElementVisibility { get; }
```